payment-service/2021-01-04_03-22-09.791715/merged.yml
---
execution:
- concurrency: 250
  executor: locust
  ramp-up: 1m
  scenario: example
included-configs:
- ../blaze_meter/apikey.yml
reporting:
- module: console
- dump-csv: ./btz_result/perf_result_csv.csv
  failed-labels: false
  module: final-stats
  percentiles: true
  summary: true
  test-duration: true
- data-source: pass-fail
  filename: ./btz_result/junit-result.xml
  module: junit-xml
- module: blazemeter
  project: Guya LTD
  report-name: Payment service test report
  test: Payment service test
scenarios:
  example:
    default-address: http://127.0.0.1:60008
    script: locust_file.py